a = b = 2  		# Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому

print("b = " + str(b))


hello = "Привет"

print("hello = " + str(hello))

hello = "Ну привет"
# Переопределите значение переменной hello

print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел
var1 = 1
var2 = 2
var3 = 3
var4 = 4
var5 = 5

print(var1, var2, var3, var4, var5)
